# Создать генератор для заполнения списка

test_list = [i for i in range(0, 10)]
print(test_list)
