# Создать и вывести список, хранящий в себе все рассмотренные в данной лекции типы данных.

x1 = 1
x2 = 1.0
x3 = 'Aa'
x4 = True  # 'bool' type
x5 = {"A": 1, "B": 2, "C": 3, "D": 4, "E": 5}
x6 = [1, 2, 3, 4, 5]
x7 = (1, 2, 3, 4, 5)
x8 = {1, 2, 3, 4, 5}
x9 = None  # NoneType

types_list = [x1, x2, x3, x4, x5, x6, x7, x8, x9]
print(types_list)
