# Создать 2 переменные с одинаковыми данными и разными идентификаторами

x1 = ['ABC']
x2 = ['ABC']
print(f" var_1 - {x1}, id_1 - {id(x1)};\n var_2 - {x2}, id_2 - {id(x2)}.")
