# Создать 3 переменные с одинаковыми данными и одинаковыми идентификаторами

x1 = 1
x2 = 1
x3 = 1
print(f" var_1 - {x1}, id_1 - {id(x1)};\n var_2 - {x2}, id_2 - {id(x2)};\n var_3 - {x3}, id_3 - {id(x3)}.")
